<a href="https://colab.research.google.com/github/alejandromunizsiques/WorkPlace/blob/master/Ejercicios_de_pandas_para_el_conjunto_de_datos_del_Titanic_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Data Science Coding Dojo/PandasParaManipulaciónDeDatos/titanic.csv')
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [38]:
Z = titanic_df.isna()
faltantes= Z == True
Z[faltantes].count()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
# ¿Cuál es el porcentaje de personas que sobrevivió? 

titanic_df["Survived"].mean()

0.3838383838383838

In [13]:
#¿Cuántos de cada sexo sobrevivieron?
A = titanic_df.groupby(["Sex"] ).count()
B = A["Survived"]
B

Sex
female    314
male      577
Name: Survived, dtype: int64

In [32]:
#¿Cuál es el porcentaje de gente que sobrevivió que pagó un pasaje de menos de 10?

filtro_1 = titanic_df['Fare'] <10
C = titanic_df[filtro_1]
C['Survived'].mean()

0.19940476190476192

In [33]:
#¿Cuál es la edad promedio de quienes no sobrevivieron?

filtro_2 = titanic_df['Survived'] == 0
D = titanic_df[filtro_1]
D["Age"].mean()

28.156440677966103

In [42]:
#¿Cuál es la edad promedio de quienes sobrevivieron?
filtro_3 = titanic_df["Survived"] == 1
E = titanic_df[filtro_3]
E["Age"].mean()

28.343689655172415

In [49]:
#Cuál es la edad promedio de quienes sobrevivieron y no sobrevivieron agrupados por sexo? parte 1
No_sobrevivientes = D.groupby(["Sex"])
No_sobrevivientes["Age"].mean()

Sex
female    23.939024
male      29.043179
Name: Age, dtype: float64

In [50]:
#Cuál es la edad promedio de quienes sobrevivieron y no sobrevivieron agrupados por sexo? parte 2

sobrevivientes = E.groupby(["Sex"])
sobrevivientes["Age"].mean()

Sex
female    28.847716
male      27.276022
Name: Age, dtype: float64